import NavButton from '@/Components/NavButton';
import React from 'react';

export default function About() {
    return (
        <section className='flex flex-col justify-center items-center gap-y-10 h-[75vh]'>
            <h2 className='text-4xl font-extrabold text-gray-900 dark:text-gray-100'>Про додаток</h2>
            <p className='text-gray-900 dark:text-gray-100 text-lg'>
                Веб-додаток &quot;Математичні приклади&quot; - це потужний і корисний інструмент для навчання і
                практикування математики, зосереджений на основних операціях{' '}
                <strong className='tracking-wider'>множення та ділення</strong>. Цей додаток спеціально розроблений для
                допомоги дітям та дорослим вдосконалити їхні навички обчислень і зрозуміти основи цих операцій.
            </p>
            <p className='text-gray-900 dark:text-gray-100 text-lg'>
                Основні можливості додатку включають:
                <li>
                    <b>Повторення множення у рамках таблиці множення:</b> Додаток генерує випадкові приклади множення,
                    але лише з використанням чисел, які належать до таблиці множення (від 1 до 10, наприклад). Це
                    дозволяє користувачам вдосконалити навички множення в межах цих обмежень і стати більш впевненими в
                    обчисленнях.
                </li>
                <li>
                    <b>Повторення ділення: </b>
                    Користувачу надаються приклади, де ділене генерується в межах від 1 до 100, а дільник - від 2 до 10.
                    Частка завжди буде цілим числом, сприяючи кращому розумінню ділення.
                </li>
            </p>
            <p className='text-gray-900 dark:text-gray-100 text-lg'>
                Додаток &quot;Математичні приклади&quot; розроблений з урахуванням простоти використання і навчання.
                Адаптивний дизайн дозволяє користувачам насолоджуватися зручним та оптимізованим інтерфейсом на різних
                пристроях та розмірах екранів. До того ж, користувачі можуть вибирати між темною та світлою темами
                відповідно до своїх вподобань та потреб. Цей додаток стане відмінним інструментом для навчання
                математики та вдосконалення обчислювальних навичок для користувачів будь-якого віку. Навчайтеся та
                практикуйтеся, користуючись цим додатком, і станьте справжнім математичним експертом!
            </p>
            <div className='my-10 lg:ml-10 text-center'>
                <NavButton path='/' text='На головну' />
            </div>
        </section>
    );
}
